8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/Project_Keil_uart/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10_DC.s
;/*****************************************************************************
; * @file:    startup_MLDR32F2C10_DC.s
; * @purpose: CMSIS Cortex-M4 Core Device Startup File for the
; *           Milandr MDR1986VK01 device series
; * @version: V1.0
; * @date:    13/08/2021
; *****************************************************************************
; * @copy
; *
; * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
; * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
; * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
; * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
; * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
; * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
; *
; ******************************************************************************
; * FILE startup_MLDR32F2C10_DC.s
; */


        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table

        DATA
__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler              ; -15 Reset Handler
        DCD     NMI_Handler                ; -14 NMI Handler
        DCD     HardFault_Handler          ; -13 Hard Fault Handler
        DCD     0                          ; -12 MPU Fault Handler
        DCD     0                          ; -11 Bus Fault Handler
        DCD     0                          ; -10 Usage Fault Handler
        DCD     0                          ; -9  Reserved
        DCD     0                          ; -8  Reserved
        DCD     0                          ; -7  Reserved
        DCD     0                          ; -6  Reserved
        DCD     SVC_Handler                ; -5  SVCall Handler
        DCD     0                          ; -4  Debug Monitor Handler
        DCD     0                          ; -3  Reserved
        DCD     PendSV_Handler             ; -2  PendSV Handler
        DCD     SysTick_Handler            ; -1  SysTick Handler

         ; External Interrupts
        DCD     0                          ; 0   Reserved
        DCD     0                          ; 1   Reserved
        DCD     0                          ; 2   Reserved
        DCD     0                          ; 3   Reserved
        DCD     0                          ; 4   Reserved
        DCD     0                          ; 5   Reserved
        DCD     0                          ; 6   Reserved
        DCD     0                          ; 7   Reserved
        DCD     0                          ; 8   Reserved
        DCD     0                          ; 9   Reserved
        DCD     0                          ; 10  Reserved
        DCD     0                          ; 11  Reserved
        DCD     0                          ; 12  Reserved
        DCD     0                          ; 13  Reserved
        DCD     0                          ; 14  Reserved
        DCD     0                          ; 15  Reserved
        DCD     0                          ; 16  Reserved
        DCD     0                          ; 17  Reserved
        DCD     0                          ; 18  Reserved
        DCD     0                          ; 19  Reserved
        DCD     0                          ; 20  Reserved
        DCD     0                          ; 21  Reserved
        DCD     0                          ; 22  Reserved
        DCD     0                          ; 23  Reserved
        DCD     0                          ; 24  Reserved
        DCD     0                          ; 25  Reserved
        DCD     0                          ; 26  Reserved
        DCD     0                          ; 27  Reserved
        DCD     0                          ; 28  Reserved
        DCD     0                          ; 29  Reserved
        DCD     0                          ; 30  Reserved
        DCD     0                          ; 31  Reserved
        DCD     FT_IF0_IRQHandler          ; 32
        DCD     FT_IF1_IRQHandler          ; 33
        DCD     FT_IF2_IRQHandler          ; 34
        DCD     FT_IF3_IRQHandler          ; 35
        DCD     CLK_IF_IRQHandler          ; 36
        DCD     PVD_IF_IRQHandler          ; 37
        DCD     RTC_IF_IRQHandler          ; 38
        DCD     BKP_IF_IRQHandler          ; 39
        DCD     EXT_INTERROR0_IRQHandler   ; 40
        DCD     EXT_INTERROR1_IRQHandler   ; 41
        DCD     EXT_INTERROR2_IRQHandler   ; 42
        DCD     EXT_INTERROR3_IRQHandler   ; 43
        DCD     EXT_INTERROR4_IRQHandler   ; 44
        DCD     EXT_INTERROR5_IRQHandler   ; 45
        DCD     EXT_INTERROR6_IRQHandler   ; 46
        DCD     EXT_INTERROR7_IRQHandler   ; 47
        DCD     IF_ERR_SCR_IRQHandler      ; 48
        DCD     IF_FIN_SCR_IRQHandler      ; 49
        DCD     DMA_ERR_IRQHandler         ; 50
        DCD     DMA_DONE0_IRQHandler       ; 51
        DCD     DMA_DONE1_IRQHandler       ; 52
        DCD     DMA_DONE2_IRQHandler       ; 53
        DCD     DMA_DONE3_IRQHandler       ; 54
        DCD     DMA_DONE4_IRQHandler       ; 55
        DCD     DMA_DONE5_IRQHandler       ; 56
        DCD     DMA_DONE6_IRQHandler       ; 57
        DCD     DMA_DONE7_IRQHandler       ; 58
        DCD     DMA_DONE8_IRQHandler       ; 59
        DCD     DMA_DONE9_IRQHandler       ; 60
        DCD     DMA_DONE10_IRQHandler      ; 61
        DCD     DMA_DONE11_IRQHandler      ; 62
        DCD     DMA_DONE12_IRQHandler      ; 63
        DCD     DMA_DONE13_IRQHandler      ; 64
        DCD     DMA_DONE14_IRQHandler      ; 65
        DCD     DMA_DONE15_IRQHandler      ; 66
        DCD     DMA_DONE16_IRQHandler      ; 67
        DCD     DMA_DONE17_IRQHandler      ; 68
        DCD     DMA_DONE18_IRQHandler      ; 69
        DCD     DMA_DONE19_IRQHandler      ; 70
        DCD     DMA_DONE20_IRQHandler      ; 71
        DCD     DMA_DONE21_IRQHandler      ; 72
        DCD     DMA_DONE22_IRQHandler      ; 73
        DCD     DMA_DONE23_IRQHandler      ; 74
        DCD     DMA_DONE24_IRQHandler      ; 75
        DCD     DMA_DONE25_IRQHandler      ; 76
        DCD     DMA_DONE26_IRQHandler      ; 77
        DCD     DMA_DONE27_IRQHandler      ; 78
        DCD     DMA_DONE28_IRQHandler      ; 79
        DCD     DMA_DONE29_IRQHandler      ; 80
        DCD     DMA_DONE30_IRQHandler      ; 81
        DCD     DMA_DONE31_IRQHandler      ; 82
        DCD     PORTA_IRQHandler           ; 83
        DCD     PORTB_IRQHandler           ; 84
        DCD     PORTC_IRQHandler           ; 85
        DCD     PORTD_IRQHandler           ; 86
        DCD     0                          ; 87  Reserved
        DCD     0                          ; 88  Reserved
        DCD     ETH_IRQHandler             ; 89
        DCD     CAN0_IRQHandler            ; 90
        DCD     CAN1_IRQHandler            ; 91
        DCD     SSP0_IRQHandler            ; 92
        DCD     SSP0_RXINTR_IRQHandler     ; 93
        DCD     SSP0_TXINTR_IRQHandler     ; 94
        DCD     SSP0_RORINTR_IRQHandler    ; 95
        DCD     SSP0_RTINTR_IRQHandler     ; 96
        DCD     SSP0_RNEINTR_IRQHandler    ; 97
        DCD     SSP0_TFEINTR_IRQHandler    ; 98
        DCD     SSP0_TBSYINTR_IRQHandler   ; 99
        DCD     SSP1_IRQHandler            ; 100
        DCD     SSP1_RXINTR_IRQHandler     ; 101
        DCD     SSP1_TXINTR_IRQHandler     ; 102
        DCD     SSP1_RORINTR_IRQHandler    ; 103
        DCD     SSP1_RTINTR_IRQHandler     ; 104
        DCD     SSP1_RNEINTR_IRQHandler    ; 105
        DCD     SSP1_TFEINTR_IRQHandler    ; 106
        DCD     SSP1_TBSYINTR_IRQHandler   ; 107
        DCD     UART0_IRQHandler           ; 108
        DCD     UART0_TBSYINTR_IRQHandler  ; 109
        DCD     UART0_TFEINTR_IRQHandler   ; 110
        DCD     UART0_RNEINTR_IRQHandler   ; 111
        DCD     UART0_EINTR_IRQHandler     ; 112
        DCD     UART0_RTINTR_IRQHandler    ; 113
        DCD     UART0_TXINTR_IRQHandler    ; 114
        DCD     UART0_RXINTR_IRQHandler    ; 115
        DCD     UART0_MSINTR_IRQHandler    ; 116
        DCD     UART1_IRQHandler           ; 117
        DCD     UART1_TBSYINTR_IRQHandler  ; 118
        DCD     UART1_TFEINTR_IRQHandler   ; 119
        DCD     UART1_RNEINTR_IRQHandler   ; 120
        DCD     UART1_EINTR_IRQHandler     ; 121
        DCD     UART1_RTINTR_IRQHandler    ; 122
        DCD     UART1_TXINTR_IRQHandler    ; 123
        DCD     UART1_RXINTR_IRQHandler    ; 124
        DCD     UART1_MSINTR_IRQHandler    ; 125
        DCD     UART2_IRQHandler           ; 126
        DCD     UART2_TBSYINTR_IRQHandler  ; 127
        DCD     UART2_TFEINTR_IRQHandler   ; 128
        DCD     UART2_RNEINTR_IRQHandler   ; 129
        DCD     UART2_EINTR_IRQHandler     ; 130
        DCD     UART2_RTINTR_IRQHandler    ; 131
        DCD     UART2_TXINTR_IRQHandler    ; 132
        DCD     UART2_RXINTR_IRQHandler    ; 133
        DCD     UART2_MSINTR_IRQHandler    ; 134
        DCD     UART3_IRQHandler           ; 135
        DCD     UART3_TBSYINTR_IRQHandler  ; 136
        DCD     UART3_TFEINTR_IRQHandler   ; 137
        DCD     UART3_RNEINTR_IRQHandler   ; 138
        DCD     UART3_EINTR_IRQHandler     ; 139
        DCD     UART3_RTINTR_IRQHandler    ; 140
        DCD     UART3_TXINTR_IRQHandler    ; 141
        DCD     UART3_RXINTR_IRQHandler    ; 142
        DCD     UART3_MSINTR_IRQHandler    ; 143
        DCD     USB_IRQHandler             ; 144
        DCD     MIL0_IRQHandler            ; 145
        DCD     DAC0_IRQHandler            ; 146
        DCD     DAC1_IRQHandler            ; 147
        DCD     DAC2_IRQHandler            ; 148
        DCD     DAC3_IRQHandler            ; 149
        DCD     DAC0_FIFO_IRQHandler       ; 150
        DCD     DAC1_FIFO_IRQHandler       ; 151
        DCD     DAC2_FIFO_IRQHandler       ; 152
        DCD     DAC3_FIFO_IRQHandler       ; 153
        DCD     TMR0_IRQHandler            ; 154
        DCD     TMR1_IRQHandler            ; 155
        DCD     TMR2_IRQHandler            ; 156
        DCD     TMR3_IRQHandler            ; 157
        DCD     QEP0_IRQHandler            ; 158
        DCD     QEP1_IRQHandler            ; 159
        DCD     0                          ; 160  Reserved
        DCD     0                          ; 161  Reserved
        DCD     CAP0_IRQHandler            ; 162
        DCD     CAP1_IRQHandler            ; 163
        DCD     CAP2_IRQHandler            ; 164
        DCD     CAP3_IRQHandler            ; 165
        DCD     EPWM9_IRQHandler           ; 166
        DCD     EPWM8_IRQHandler           ; 167
        DCD     EPWM7_IRQHandler           ; 168
        DCD     EPWM6_IRQHandler           ; 169
        DCD     EPWM5_IRQHandler           ; 170
        DCD     EPWM4_IRQHandler           ; 171
        DCD     EPWM3_IRQHandler           ; 172
        DCD     EPWM2_IRQHandler           ; 173
        DCD     EPWM1_IRQHandler           ; 174
        DCD     EPWM_TZ9_IRQHandler        ; 175
        DCD     EPWM_TZ8_IRQHandler        ; 176
        DCD     EPWM_TZ7_IRQHandler        ; 177
        DCD     EPWM_TZ6_IRQHandler        ; 178
        DCD     EPWM_TZ5_IRQHandler        ; 179
        DCD     EPWM_TZ4_IRQHandler        ; 180
        DCD     EPWM_TZ3_IRQHandler        ; 181
        DCD     EPWM_TZ2_IRQHandler        ; 182
        DCD     EPWM_TZ1_IRQHandler        ; 183
        DCD     EPWM_FIFO9_IRQHandler      ; 184
        DCD     EPWM_FIFO8_IRQHandler      ; 185
        DCD     EPWM_FIFO7_IRQHandler      ; 186
        DCD     EPWM_FIFO6_IRQHandler      ; 187
        DCD     EPWM_FIFO5_IRQHandler      ; 188
        DCD     EPWM_FIFO4_IRQHandler      ; 189
        DCD     EPWM_FIFO3_IRQHandler      ; 190
        DCD     EPWM_FIFO2_IRQHandler      ; 191
        DCD     EPWM_FIFO1_IRQHandler      ; 192
        DCD     CMP0_IRQHandler            ; 193
        DCD     CMP1_IRQHandler            ; 194
        DCD     CMP2_IRQHandler            ; 195
        DCD     CMP3_IRQHandler            ; 196
        DCD     ADC00_IRQHandler           ; 197
        DCD     ADC_FIFO00_IRQHandler      ; 198
        DCD     ADC10_IRQHandler           ; 199
        DCD     ADC_FIFO10_IRQHandler      ; 200
        DCD     ADC20_IRQHandler           ; 201
        DCD     ADC_FIFO20_IRQHandler      ; 202
        DCD     ADC01_IRQHandler           ; 203
        DCD     ADC_FIFO01_IRQHandler      ; 204
        DCD     ADC11_IRQHandler           ; 205
        DCD     ADC_FIFO11_IRQHandler      ; 206
        DCD     ADC21_IRQHandler           ; 207
        DCD     ADC_FIFO21_IRQHandler      ; 208
        DCD     CRCD_IRQHandler            ; 209
        DCD     CANFD_IRQHandler           ; 210
        DCD     MIL1_IRQHandler            ; 211
        DCD     0                          ; 212 Reserved
        DCD     0                          ; 213 Reserved
        DCD     0                          ; 214 Reserved
        DCD     0                          ; 215 Reserved
        DCD     SDIO_IRQHandler            ; 216

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:NOROOT(2)

