8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/Project_Keil_uart/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10_DC.s
BKP_KEY         EQU     0x8555aaa1
BKP_BASE        EQU     0x40001000  
;BKP_BASE_KEY    EQU     0x400010F0  
BKP_RG60_0      EQU     0x40001100  
SMP_REG         EQU     0xE00FE000  
;STACK_BASE1     EQU     0x20000000
VTOR_REG        EQU     0xE000ED08 

Reset_Handler
        LDR     R0, =SystemInit
        BLX     R0
        
        LDR     R0, =__vector_table
        LDR     R1, =VTOR_REG
        STR     R0, [R1] 
        
        // do not set breakpoint before this line!        

        ldr	r0, =start_ls_exit - 1	
        ldr	r1, =end_ls_exit
        ldr	r2, =sfb(CSTACK) // temporary use stack
        sub	r3, r1, r0
;       sub	r0, r0, #1
copy_ls_exit    // copy to RAM
        subs	       r3, #4
        ldr	r4, [r0], #4
        str	r4, [r2], #4
        bgt	copy_ls_exit    

        ldr	r3, =BKP_KEY
        ldr	r1, =BKP_BASE
        ldr     r0, =1 + sfb(CSTACK)
        BLX     r0 // Disable LockStep
        NOP
                
        LDR     R0, =SMP_REG
        LDR     R1,[R0]
        TST     R1,#1
        BNE     core1
        ldr     r1, =sizeof(CSTACK)
        lsr     r1, r1, #1
        SUB     sp, sp, r1 // core0 use lower half of stack
core1

        LDR     R0, =__iar_program_start
        BX      R0
        
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ALIGNROM 2
start_ls_exit
        str	r3, [r1,#0x0f0]
        mov	r2, #0x100
        ldr	r0, [r1,#0x100]
        orr     r0, r0, #0x0200 // DUALCORE
        str	r0, [r1,r2]  
        DMB 	
        mov	r0, #0
        str	r0, [r1, #0x0f0]
        bx	lr
        nop
end_ls_exit        

        PUBWEAK NMI_Handler
        SECTION .text:CODE:NOROOT(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT(1)
BusFault_Handler
        B BusFault_Handler

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:NOROOT(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:NOROOT(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:NOROOT(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:NOROOT(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:NOROOT(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK FT_IF0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF0_IRQHandler
        B FT_IF0_IRQHandler

        PUBWEAK FT_IF1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF1_IRQHandler
        B FT_IF1_IRQHandler

        PUBWEAK FT_IF2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF2_IRQHandler
        B FT_IF2_IRQHandler

        PUBWEAK FT_IF3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
FT_IF3_IRQHandler
        B FT_IF3_IRQHandler

        PUBWEAK CLK_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CLK_IF_IRQHandler
        B CLK_IF_IRQHandler

        PUBWEAK PVD_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PVD_IF_IRQHandler
        B PVD_IF_IRQHandler

        PUBWEAK RTC_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
RTC_IF_IRQHandler
        B RTC_IF_IRQHandler

        PUBWEAK BKP_IF_IRQHandler
        SECTION .text:CODE:NOROOT(1)
BKP_IF_IRQHandler
        B BKP_IF_IRQHandler

        PUBWEAK EXT_INTERROR0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR0_IRQHandler
        B EXT_INTERROR0_IRQHandler

        PUBWEAK EXT_INTERROR1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR1_IRQHandler
        B EXT_INTERROR1_IRQHandler

        PUBWEAK EXT_INTERROR2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR2_IRQHandler
        B EXT_INTERROR2_IRQHandler

        PUBWEAK EXT_INTERROR3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR3_IRQHandler
        B EXT_INTERROR3_IRQHandler

        PUBWEAK EXT_INTERROR4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR4_IRQHandler
        B EXT_INTERROR4_IRQHandler

        PUBWEAK EXT_INTERROR5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR5_IRQHandler
        B EXT_INTERROR5_IRQHandler

        PUBWEAK EXT_INTERROR6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR6_IRQHandler
        B EXT_INTERROR6_IRQHandler

        PUBWEAK EXT_INTERROR7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EXT_INTERROR7_IRQHandler
        B EXT_INTERROR7_IRQHandler

        PUBWEAK IF_ERR_SCR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
IF_ERR_SCR_IRQHandler
        B IF_ERR_SCR_IRQHandler

        PUBWEAK IF_FIN_SCR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
IF_FIN_SCR_IRQHandler
        B IF_FIN_SCR_IRQHandler

        PUBWEAK DMA_ERR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_ERR_IRQHandler
        B DMA_ERR_IRQHandler

        PUBWEAK DMA_DONE0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE0_IRQHandler
        B DMA_DONE0_IRQHandler

        PUBWEAK DMA_DONE1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE1_IRQHandler
        B DMA_DONE1_IRQHandler

        PUBWEAK DMA_DONE2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE2_IRQHandler
        B DMA_DONE2_IRQHandler

        PUBWEAK DMA_DONE3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE3_IRQHandler
        B DMA_DONE3_IRQHandler

        PUBWEAK DMA_DONE4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE4_IRQHandler
        B DMA_DONE4_IRQHandler

        PUBWEAK DMA_DONE5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE5_IRQHandler
        B DMA_DONE5_IRQHandler

        PUBWEAK DMA_DONE6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE6_IRQHandler
        B DMA_DONE6_IRQHandler

        PUBWEAK DMA_DONE7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE7_IRQHandler
        B DMA_DONE7_IRQHandler

