8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/Project_Keil_uart/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10_DC.s
        PUBWEAK DMA_DONE8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE8_IRQHandler
        B DMA_DONE8_IRQHandler

        PUBWEAK DMA_DONE9_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE9_IRQHandler
        B DMA_DONE9_IRQHandler

        PUBWEAK DMA_DONE10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE10_IRQHandler
        B DMA_DONE10_IRQHandler

        PUBWEAK DMA_DONE11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE11_IRQHandler
        B DMA_DONE11_IRQHandler

        PUBWEAK DMA_DONE12_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE12_IRQHandler
        B DMA_DONE12_IRQHandler

        PUBWEAK DMA_DONE13_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE13_IRQHandler
        B DMA_DONE13_IRQHandler

        PUBWEAK DMA_DONE14_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE14_IRQHandler
        B DMA_DONE14_IRQHandler

        PUBWEAK DMA_DONE15_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE15_IRQHandler
        B DMA_DONE15_IRQHandler

        PUBWEAK DMA_DONE16_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE16_IRQHandler
        B DMA_DONE16_IRQHandler

        PUBWEAK DMA_DONE17_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE17_IRQHandler
        B DMA_DONE17_IRQHandler

        PUBWEAK DMA_DONE18_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE18_IRQHandler
        B DMA_DONE18_IRQHandler

        PUBWEAK DMA_DONE19_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE19_IRQHandler
        B DMA_DONE19_IRQHandler

        PUBWEAK DMA_DONE20_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE20_IRQHandler
        B DMA_DONE20_IRQHandler

        PUBWEAK DMA_DONE21_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE21_IRQHandler
        B DMA_DONE21_IRQHandler

        PUBWEAK DMA_DONE22_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE22_IRQHandler
        B DMA_DONE22_IRQHandler

        PUBWEAK DMA_DONE23_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE23_IRQHandler
        B DMA_DONE23_IRQHandler

        PUBWEAK DMA_DONE24_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE24_IRQHandler
        B DMA_DONE24_IRQHandler

        PUBWEAK DMA_DONE25_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE25_IRQHandler
        B DMA_DONE25_IRQHandler

        PUBWEAK DMA_DONE26_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE26_IRQHandler
        B DMA_DONE26_IRQHandler

        PUBWEAK DMA_DONE27_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE27_IRQHandler
        B DMA_DONE27_IRQHandler

        PUBWEAK DMA_DONE28_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE28_IRQHandler
        B DMA_DONE28_IRQHandler

        PUBWEAK DMA_DONE29_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE29_IRQHandler
        B DMA_DONE29_IRQHandler

        PUBWEAK DMA_DONE30_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE30_IRQHandler
        B DMA_DONE30_IRQHandler

        PUBWEAK DMA_DONE31_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE31_IRQHandler
        B DMA_DONE31_IRQHandler

        PUBWEAK PORTA_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTA_IRQHandler
        B PORTA_IRQHandler

        PUBWEAK PORTB_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTB_IRQHandler
        B PORTB_IRQHandler

        PUBWEAK PORTC_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTC_IRQHandler
        B PORTC_IRQHandler

        PUBWEAK PORTD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTD_IRQHandler
        B PORTD_IRQHandler

        PUBWEAK ETH_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ETH_IRQHandler
        B ETH_IRQHandler

        PUBWEAK CAN0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAN0_IRQHandler
        B CAN0_IRQHandler

        PUBWEAK CAN1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAN1_IRQHandler
        B CAN1_IRQHandler

        PUBWEAK SSP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_IRQHandler
        B SSP0_IRQHandler

        PUBWEAK SSP0_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RXINTR_IRQHandler
        B SSP0_RXINTR_IRQHandler

        PUBWEAK SSP0_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TXINTR_IRQHandler
        B SSP0_TXINTR_IRQHandler

        PUBWEAK SSP0_RORINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RORINTR_IRQHandler
        B SSP0_RORINTR_IRQHandler

        PUBWEAK SSP0_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RTINTR_IRQHandler
        B SSP0_RTINTR_IRQHandler

        PUBWEAK SSP0_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RNEINTR_IRQHandler
        B SSP0_RNEINTR_IRQHandler

        PUBWEAK SSP0_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TFEINTR_IRQHandler
        B SSP0_TFEINTR_IRQHandler

        PUBWEAK SSP0_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TBSYINTR_IRQHandler
        B SSP0_TBSYINTR_IRQHandler

        PUBWEAK SSP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_IRQHandler
        B SSP1_IRQHandler

        PUBWEAK SSP1_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RXINTR_IRQHandler
        B SSP1_RXINTR_IRQHandler

        PUBWEAK SSP1_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TXINTR_IRQHandler
        B SSP1_TXINTR_IRQHandler

        PUBWEAK SSP1_RORINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RORINTR_IRQHandler
        B SSP1_RORINTR_IRQHandler

        PUBWEAK SSP1_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RTINTR_IRQHandler
        B SSP1_RTINTR_IRQHandler

        PUBWEAK SSP1_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RNEINTR_IRQHandler
        B SSP1_RNEINTR_IRQHandler

        PUBWEAK SSP1_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TFEINTR_IRQHandler
        B SSP1_TFEINTR_IRQHandler

        PUBWEAK SSP1_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TBSYINTR_IRQHandler
        B SSP1_TBSYINTR_IRQHandler

        PUBWEAK UART0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_IRQHandler
        B UART0_IRQHandler

