8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/Project_Keil_uart/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10_DC.s
        PUBWEAK UART0_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TBSYINTR_IRQHandler
        B UART0_TBSYINTR_IRQHandler

        PUBWEAK UART0_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TFEINTR_IRQHandler
        B UART0_TFEINTR_IRQHandler

        PUBWEAK UART0_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RNEINTR_IRQHandler
        B UART0_RNEINTR_IRQHandler

        PUBWEAK UART0_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_EINTR_IRQHandler
        B UART0_EINTR_IRQHandler

        PUBWEAK UART0_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RTINTR_IRQHandler
        B UART0_RTINTR_IRQHandler

        PUBWEAK UART0_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TXINTR_IRQHandler
        B UART0_TXINTR_IRQHandler

        PUBWEAK UART0_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RXINTR_IRQHandler
        B UART0_RXINTR_IRQHandler

        PUBWEAK UART0_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_MSINTR_IRQHandler
        B UART0_MSINTR_IRQHandler

        PUBWEAK UART1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_IRQHandler
        B UART1_IRQHandler

        PUBWEAK UART1_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TBSYINTR_IRQHandler
        B UART1_TBSYINTR_IRQHandler

        PUBWEAK UART1_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TFEINTR_IRQHandler
        B UART1_TFEINTR_IRQHandler

        PUBWEAK UART1_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RNEINTR_IRQHandler
        B UART1_RNEINTR_IRQHandler

        PUBWEAK UART1_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_EINTR_IRQHandler
        B UART1_EINTR_IRQHandler

        PUBWEAK UART1_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RTINTR_IRQHandler
        B UART1_RTINTR_IRQHandler

        PUBWEAK UART1_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TXINTR_IRQHandler
        B UART1_TXINTR_IRQHandler

        PUBWEAK UART1_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RXINTR_IRQHandler
        B UART1_RXINTR_IRQHandler

        PUBWEAK UART1_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_MSINTR_IRQHandler
        B UART1_MSINTR_IRQHandler

        PUBWEAK UART2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_IRQHandler
        B UART2_IRQHandler

        PUBWEAK UART2_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TBSYINTR_IRQHandler
        B UART2_TBSYINTR_IRQHandler

        PUBWEAK UART2_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TFEINTR_IRQHandler
        B UART2_TFEINTR_IRQHandler

        PUBWEAK UART2_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RNEINTR_IRQHandler
        B UART2_RNEINTR_IRQHandler

        PUBWEAK UART2_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_EINTR_IRQHandler
        B UART2_EINTR_IRQHandler

        PUBWEAK UART2_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RTINTR_IRQHandler
        B UART2_RTINTR_IRQHandler

        PUBWEAK UART2_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TXINTR_IRQHandler
        B UART2_TXINTR_IRQHandler

        PUBWEAK UART2_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RXINTR_IRQHandler
        B UART2_RXINTR_IRQHandler

        PUBWEAK UART2_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_MSINTR_IRQHandler
        B UART2_MSINTR_IRQHandler

        PUBWEAK UART3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_IRQHandler
        B UART3_IRQHandler

        PUBWEAK UART3_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TBSYINTR_IRQHandler
        B UART3_TBSYINTR_IRQHandler

        PUBWEAK UART3_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TFEINTR_IRQHandler
        B UART3_TFEINTR_IRQHandler

        PUBWEAK UART3_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RNEINTR_IRQHandler
        B UART3_RNEINTR_IRQHandler

        PUBWEAK UART3_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_EINTR_IRQHandler
        B UART3_EINTR_IRQHandler

        PUBWEAK UART3_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RTINTR_IRQHandler
        B UART3_RTINTR_IRQHandler

        PUBWEAK UART3_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TXINTR_IRQHandler
        B UART3_TXINTR_IRQHandler

        PUBWEAK UART3_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RXINTR_IRQHandler
        B UART3_RXINTR_IRQHandler

        PUBWEAK UART3_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_MSINTR_IRQHandler
        B UART3_MSINTR_IRQHandler

        PUBWEAK USB_IRQHandler
        SECTION .text:CODE:NOROOT(1)
USB_IRQHandler
        B USB_IRQHandler

        PUBWEAK MIL0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
MIL0_IRQHandler
        B MIL0_IRQHandler

        PUBWEAK DAC0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC0_IRQHandler
        B DAC0_IRQHandler

        PUBWEAK DAC1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC1_IRQHandler
        B DAC1_IRQHandler

        PUBWEAK DAC2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC2_IRQHandler
        B DAC2_IRQHandler

        PUBWEAK DAC3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC3_IRQHandler
        B DAC3_IRQHandler

        PUBWEAK DAC0_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC0_FIFO_IRQHandler
        B DAC0_FIFO_IRQHandler

        PUBWEAK DAC1_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC1_FIFO_IRQHandler
        B DAC1_FIFO_IRQHandler

        PUBWEAK DAC2_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC2_FIFO_IRQHandler
        B DAC2_FIFO_IRQHandler

        PUBWEAK DAC3_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC3_FIFO_IRQHandler
        B DAC3_FIFO_IRQHandler

        PUBWEAK TMR0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TMR0_IRQHandler
        B TMR0_IRQHandler

        PUBWEAK TMR1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TMR1_IRQHandler
        B TMR1_IRQHandler

        PUBWEAK TMR2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TMR2_IRQHandler
        B TMR2_IRQHandler

