8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/Project_Keil_uart/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10_DC.s
        PUBWEAK TMR3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TMR3_IRQHandler
        B TMR3_IRQHandler

        PUBWEAK QEP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
QEP0_IRQHandler
        B QEP0_IRQHandler

        PUBWEAK QEP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
QEP1_IRQHandler
        B QEP1_IRQHandler

        PUBWEAK CAP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP0_IRQHandler
        B CAP0_IRQHandler

        PUBWEAK CAP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP1_IRQHandler
        B CAP1_IRQHandler

        PUBWEAK CAP2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP2_IRQHandler
        B CAP2_IRQHandler

        PUBWEAK CAP3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP3_IRQHandler
        B CAP3_IRQHandler

        PUBWEAK EPWM9_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM9_IRQHandler
        B EPWM9_IRQHandler

        PUBWEAK EPWM8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM8_IRQHandler
        B EPWM8_IRQHandler

        PUBWEAK EPWM7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM7_IRQHandler
        B EPWM7_IRQHandler

        PUBWEAK EPWM6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM6_IRQHandler
        B EPWM6_IRQHandler

        PUBWEAK EPWM5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM5_IRQHandler
        B EPWM5_IRQHandler

        PUBWEAK EPWM4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM4_IRQHandler
        B EPWM4_IRQHandler

        PUBWEAK EPWM3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM3_IRQHandler
        B EPWM3_IRQHandler

        PUBWEAK EPWM2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM2_IRQHandler
        B EPWM2_IRQHandler

        PUBWEAK EPWM1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM1_IRQHandler
        B EPWM1_IRQHandler

        PUBWEAK EPWM_TZ9_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ9_IRQHandler
        B EPWM_TZ9_IRQHandler

        PUBWEAK EPWM_TZ8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ8_IRQHandler
        B EPWM_TZ8_IRQHandler

        PUBWEAK EPWM_TZ7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ7_IRQHandler
        B EPWM_TZ7_IRQHandler

        PUBWEAK EPWM_TZ6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ6_IRQHandler
        B EPWM_TZ6_IRQHandler

        PUBWEAK EPWM_TZ5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ5_IRQHandler
        B EPWM_TZ5_IRQHandler

        PUBWEAK EPWM_TZ4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ4_IRQHandler
        B EPWM_TZ4_IRQHandler

        PUBWEAK EPWM_TZ3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ3_IRQHandler
        B EPWM_TZ3_IRQHandler

        PUBWEAK EPWM_TZ2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ2_IRQHandler
        B EPWM_TZ2_IRQHandler

        PUBWEAK EPWM_TZ1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ1_IRQHandler
        B EPWM_TZ1_IRQHandler

        PUBWEAK EPWM_FIFO9_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO9_IRQHandler
        B EPWM_FIFO9_IRQHandler

        PUBWEAK EPWM_FIFO8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO8_IRQHandler
        B EPWM_FIFO8_IRQHandler

        PUBWEAK EPWM_FIFO7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO7_IRQHandler
        B EPWM_FIFO7_IRQHandler

        PUBWEAK EPWM_FIFO6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO6_IRQHandler
        B EPWM_FIFO6_IRQHandler

        PUBWEAK EPWM_FIFO5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO5_IRQHandler
        B EPWM_FIFO5_IRQHandler

        PUBWEAK EPWM_FIFO4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO4_IRQHandler
        B EPWM_FIFO4_IRQHandler

        PUBWEAK EPWM_FIFO3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO3_IRQHandler
        B EPWM_FIFO3_IRQHandler

        PUBWEAK EPWM_FIFO2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO2_IRQHandler
        B EPWM_FIFO2_IRQHandler

        PUBWEAK EPWM_FIFO1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO1_IRQHandler
        B EPWM_FIFO1_IRQHandler

        PUBWEAK CMP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP0_IRQHandler
        B CMP0_IRQHandler

        PUBWEAK CMP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP1_IRQHandler
        B CMP1_IRQHandler

        PUBWEAK CMP2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP2_IRQHandler
        B CMP2_IRQHandler

        PUBWEAK CMP3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP3_IRQHandler
        B CMP3_IRQHandler

        PUBWEAK ADC21_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC21_IRQHandler
        B ADC21_IRQHandler

        PUBWEAK ADC_FIFO21_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO21_IRQHandler
        B ADC_FIFO21_IRQHandler

        PUBWEAK ADC11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC11_IRQHandler
        B ADC11_IRQHandler

        PUBWEAK ADC_FIFO11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO11_IRQHandler
        B ADC_FIFO11_IRQHandler

        PUBWEAK ADC01_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC01_IRQHandler
        B ADC01_IRQHandler

        PUBWEAK ADC_FIFO01_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO01_IRQHandler
        B ADC_FIFO01_IRQHandler

        PUBWEAK ADC20_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC20_IRQHandler
        B ADC20_IRQHandler

        PUBWEAK ADC_FIFO20_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO20_IRQHandler
        B ADC_FIFO20_IRQHandler

        PUBWEAK ADC10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC10_IRQHandler
        B ADC10_IRQHandler

        PUBWEAK ADC_FIFO10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO10_IRQHandler
        B ADC_FIFO10_IRQHandler

        PUBWEAK ADC00_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC00_IRQHandler
        B ADC00_IRQHandler

        PUBWEAK ADC_FIFO00_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO00_IRQHandler
        B ADC_FIFO00_IRQHandler

        PUBWEAK CRCD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CRCD_IRQHandler
        B CRCD_IRQHandler

        PUBWEAK CANFD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CANFD_IRQHandler
        B CANFD_IRQHandler

        PUBWEAK MIL1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
MIL1_IRQHandler
        B MIL1_IRQHandler

        PUBWEAK SDIO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SDIO_IRQHandler
        B SDIO_IRQHandler

        END
;/******************* (C) COPYRIGHT 2021 Milandr *******************************
;*
;* END OF FILE startup_MLDR32F2C10_DC.s */
